Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_integration.strategy_int will be created
+ resource "aws_api_gateway_integration" "strategy_int" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "70paytfqfb"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.strategy_post will be created
+ resource "aws_api_gateway_method" "strategy_post" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "70paytfqfb"
    }

  # aws_api_gateway_resource.strategy will be created
+ resource "aws_api_gateway_resource" "strategy" {
      + id          = (known after apply)
      + parent_id   = "wz1cllrxrg"
      + path        = (known after apply)
      + path_part   = "strategy"
      + rest_api_id = "70paytfqfb"
    }

  # aws_api_gateway_resource.strategy_upload will be created
+ resource "aws_api_gateway_resource" "strategy_upload" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "upload-url"
      + rest_api_id = "70paytfqfb"
    }

  # aws_api_gateway_stage.api_stage will be updated in-place
~ resource "aws_api_gateway_stage" "api_stage" {
      ~ deployment_id         = "h7vv0k" -> "auxvbl"
        id                    = "ags-70paytfqfb-prod"
        tags                  = {}
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.strategy_presign will be created
+ resource "aws_lambda_function" "strategy_presign" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/websites/feedutopia/backend/strategy_presign/strategy_presign.zip"
      + function_name                  = "sharedservices-strategy-presign"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::825765422855:role/sharedservices_lambda_role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "c9F8q6NbpS2E47YI03Ah+xaxTWKGjhi5SfzuUBZLZc8="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = "arn:aws:sqs:us-east-2:825765422855:sharedservices-lambda-dlq"
        }

      + environment {
          + variables = {
              + "BUCKET" = "feedutopia-webapp"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_permission.allow_apigw_invoke_strategy_presign will be created
+ resource "aws_lambda_permission" "allow_apigw_invoke_strategy_presign" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sharedservices-strategy-presign"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-2:825765422855:70paytfqfb/*/POST/strategy/upload-url"
      + statement_id        = "AllowAPIGatewayInvokeStrategyPresign"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket_policy.feedutopia_webapp will be updated in-place
~ resource "aws_s3_bucket_policy" "feedutopia_webapp" {
        id     = "feedutopia-webapp"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action    = [
                            "s3:PutObject",
                            "s3:PutObjectAcl",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::825765422855:role/sharedservices_lambda_role"
                        }
                        Resource  = "arn:aws:s3:::feedutopia-webapp/kb/*"
                        Sid       = "AllowLambdaWriteKB"
                    },
                  + {
                      + Action    = [
                          + "s3:PutObject",
                          + "s3:PutObjectAcl",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::825765422855:role/sharedservices_lambda_role"
                        }
                      + Resource  = "arn:aws:s3:::feedutopia-webapp/strategies/*"
                      + Sid       = "AllowLambdaWriteStrategy"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 2 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 6 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```